## Задание ##
На основе выбранных продуктов из первого вебинара, выберите 2 A/B-теста и составьте план эксперимента, чтобы избежать Peeking Problem

Распишите, какие метрики и как вы будете анализировать

### Приоритезацию гипотез из второго урока с помощью ICE ###
<table>
<tr><td><b>Idea (Гипотеза)</b></td><td><b>Impact (Личная уверенность)</b></td><td><b>Confidence (Уверенность)</b></td><td><b>Ease (Легкость)</b></td><td><b>ICE Score (I х С х E)</b></td></tr>
<tr><td>1.сделать в каталоге «бесконечную страницу»</td><td>6</td><td>1</td><td>7</td><td>42</td></tr>
<tr><td>2.добавить пункт «заказ в 1 клик»</td><td>8</td><td>2</td><td>8</td><td>128</td></tr>
<tr><td>3.добавить рекомендации на основании уже сделанных заказов</td><td>7</td><td>2</td><td>7</td><td>98</td></tr>
<tr><td>4.при наведении на товар, выводить краткие характеристики этого товара</td><td>5</td><td>1</td><td>6</td><td>30</td></tr>
<tr><td>5.уменьшить время доставки</td><td>7</td><td>2</td><td>8</td><td>112</td></tr>
</table>

## Решение ##
На основе задания из второго урока было принято решение по итогам ICE, составить шаблоны эксперимента для двух гипотез набравших максимальное количество очков:
+ добавить пункт «заказ в 1 клик» - 128 баллов
+  уменьшить время доставки - 112 балов

### 1. Шаблон А/B-теста добавить пункт «заказ в 1 клик» ###

#### Гипотеза ####
Если на главной странице, на странице товара и в корзине добавить кнопку «заказ в один клик», то % показателя конверсии увеличится на 1-2%, потому что, долгое заполнение полной формы заказа может отпугивать клиента, а быстрый заказ с вводом минимальной информации, позволит совершать «импульсивные» покупки.
#### Что делаем ####

**Контрольная версия:** оставляем текущий вид сайта со старыми способами доставки. 

**Тестовая версия:** на главной странице и на странице товара добавляем кнопку «заказ в один клик». 

**На каких пользователях тестируем:** только на новых пользователях. 

**Метрики:**
+ Процент конверсии в заказ (%CR) — primary. 
+ «забытая корзина» — secondary. 

#### План действий ####
Если наш эксперимент будет положительным и мы зафиксируем ожидаемое улучшение в ключевых метриках и не посадим добавочные, то масштабируем изменение и «выкатываем» его на всех пользователей. 

Если основные метрики падают или растут недостаточно либо добавочные метрики падают, откатываем эксперимент.

### 2. Шаблон А/B-теста уменьшить время доставки ###

#### Гипотеза ####
Если добавить новый способ доставки квадрокоптером, то % конверсии в заказ увеличится на 5%, потому что по результатам опроса, пользователи хотят иметь больше выбора и удобства при получении товаров.
#### Что делаем ####

**Контрольная версия:** оставляем текущий вид сайта со старыми способами доставки. 

**Тестовая версия:** добавляем новый способ доставки на сайт и показываем их пользователям в корзине и на странице оформления заказа.. 

**На каких пользователях тестируем:** только пользователей и г.Кольчугино. 

**Метрики:**
+ Процент конверсии в заказ (%CR) — primary. 
+ «забытая корзина» — secondary. 

#### План действий ####
Если наш эксперимент будет положительным и мы зафиксируем ожидаемое улучшение в ключевых метриках и не посадим добавочные, то масштабируем изменение и «выкатываем» его на всех пользователей из крупных городов. 

Если основные метрики падают или растут недостаточно либо добавочные метрики падают, откатываем эксперимент.

